In [1]:
import pandas as pd
import matplotlib.pyplot as plt
from sklearn import linear_model
import seaborn as sns
from scipy import stats

In [74]:
df=pd.read_csv("homeprices2.csv")
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      NaN   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000
5  4100      6.0    8  810000

In [75]:
df["bedroom"].median()

4.0

In [76]:
df["bedroom"]=df["bedroom"].fillna(df["bedroom"].median())

In [77]:
df["bedroom"]

0    3.0
1    4.0
2    4.0
3    3.0
4    5.0
5    6.0
Name: bedroom, dtype: float64

In [78]:
df

   area  bedroom  age   price
0  2600      3.0   20  550000
1  3000      4.0   15  565000
2  3200      4.0   18  610000
3  3600      3.0   30  680000
4  4000      5.0    8  725000
5  4100      6.0    8  810000

In [79]:
x=df.drop(columns="price")
x

   area  bedroom  age
0  2600      3.0   20
1  3000      4.0   15
2  3200      4.0   18
3  3600      3.0   30
4  4000      5.0    8
5  4100      6.0    8

In [80]:
y=df.price
y

0    550000
1    565000
2    610000
3    680000
4    725000
5    810000
Name: price, dtype: int64

In [81]:
model=linear_model.LinearRegression()
model.fit(x,y)

LinearRegression()

In [82]:
y_predict=model.predict(x)
y_predict

array([517441.41347773, 592845.1941304 , 630078.69436829, 679772.7152578 ,
       727509.83679604, 792352.14596975])

In [83]:
x["y_predict"]=y_predict

In [84]:
x

   area  bedroom  age      y_predict
0  2600      3.0   20  517441.413478
1  3000      4.0   15  592845.194130
2  3200      4.0   18  630078.694368
3  3600      3.0   30  679772.715258
4  4000      5.0    8  727509.836796
5  4100      6.0    8  792352.145970

In [85]:
model.coef_

array([  114.65890296, 53376.41887759,  4767.23988188])

In [86]:
model.intercept_

-36145.78849189228

In [ ]:
#Y=mx+b
#Y-dependent,m-coef,x-independent,b-intercept

In [87]:
#the price of a home with 3000sqr,3bedroom,40year old
model.predict([[3000,3,40]])
#the price of a home with 3000sqr,3bedroom,40year is 658649.77229988

C:\Users\Dafe\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([658649.77229988])

In [21]:
from word2number import w2n
df=pd.read_csv("Hiring.csv")
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [22]:
df["test_score(out of 10)"].median()

8.0

In [23]:
df["test_score(out of 10)"]=df["test_score(out of 10)"].fillna(
df["test_score(out of 10)"].median())

In [24]:
df["test_score(out of 10)"]

0     8.0
1     8.0
2     6.0
3    10.0
4     9.0
5     7.0
6     8.0
7     7.0
Name: test_score(out of 10), dtype: float64

In [25]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [26]:
df["experience"]=df["experience"].fillna("zero")

In [27]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [28]:
df["experience"]=df["experience"].apply(w2n.word_to_num)

In [29]:
df["experience"]

0     0
1     0
2     5
3     2
4     7
5     3
6    10
7    11
Name: experience, dtype: int64

In [30]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                    8.0                           9      50000
1           0                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [37]:
x=df.drop(columns="salary($)")
x

   experience  test_score(out of 10)  interview_score(out of 10)
0           0                    8.0                           9
1           0                    8.0                           6
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    8.0                           7
7          11                    7.0                           8

In [39]:
y=df["salary($)"]
y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [40]:
reg=linear_model.LinearRegression()

In [42]:
reg.fit(x,y)

LinearRegression()

In [44]:
y_pred=reg.predict(x)
y_pred

array([52350.0727802 , 45734.35225619, 58312.95487627, 63872.63464338,
       67270.74235808, 61148.47161572, 76069.1411936 , 79241.63027656])

In [45]:
x["y_pred"]=y_pred

In [47]:
x.head()

   experience  test_score(out of 10)  interview_score(out of 10)        y_pred
0           0                    8.0                           9  52350.072780
1           0                    8.0                           6  45734.352256
2           5                    6.0                           7  58312.954876
3           2                   10.0                          10  63872.634643
4           7                    9.0                           6  67270.742358

In [48]:
#2yr experience,9 test score,6interview score
reg.predict([[2,9,6]])

C:\Users\Dafe\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([53205.96797671])

In [49]:
#12yr experience,10 test,10 interview\
reg.predict([[12,10,10]])

C:\Users\Dafe\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([92002.18340611])